In [ ]:
#Data.csv

**Step 1: Importing the libraries**

In [6]:
import pandas as pd
import numpy as np
from sklearn.preprocessing import LabelEncoder
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import StandardScaler

**Step 2: Importing dataset**

In [3]:
data=pd.read_csv("Data.csv")

**Step 3: Handling the missing data**

In [4]:
data.isna().sum()

Country      0
Age          1
Salary       1
Purchased    0
dtype: int64

In [7]:
data['Age']= data['Age'].fillna(data['Age'].mean())
data['Salary']= data['Salary'].fillna(data['Salary'].mean())

**Step 4: Encoding categorical data**

In [10]:
data.dtypes

Country       object
Age          float64
Salary       float64
Purchased     object
dtype: object

In [20]:
le=LabelEncoder()
for column in data.columns:
    if data[column].dtypes==object:
        data[column]=le.fit_transform(data[column])

In [21]:
data.head()

   Country   Age        Salary  Purchased
0        0  44.0  72000.000000          0
1        2  27.0  48000.000000          1
2        1  30.0  54000.000000          0
3        2  38.0  61000.000000          0
4        1  40.0  63777.777778          1

**Step 5: Creating a dummy variable**

In [22]:
data = pd.get_dummies(data,columns=['Country','Purchased'])

In [23]:
data.head()

,Age,Salary,Country_0,Country_1,Country_2,Purchased_0,Purchased_1
0,44.0,72000.000000,1,0,0,1,0
1,27.0,48000.000000,0,0,1,0,1
2,30.0,54000.000000,0,1,0,1,0
3,38.0,61000.000000,0,0,1,1,0
4,40.0,63777.777778,0,1,0,0,1

**Step 6: Splitting the datasets into training sets and Test sets**

In [24]:
X=data.drop(columns=['Salary'])
Y=data['Salary']

In [25]:
x_train,x_test,y_train,y_test = train_test_split(X,Y,test_size=0.2,random_state=10)

**Step 7: Feature Scaling**

In [26]:
scaler = StandardScaler()
x_train = scaler.fit_transform(x_train)
x_test = scaler.transform(x_test)